Grouping and aggregating helps you to summarize your data -- like answering
# '' What is the average salary.per department?"
# '' How many users joined the Gym per month?"

.groupby() Function -- df.groupby() is used to group rows of a DataFrame based on the values in one 
or more columns, which allow you to then perform aggregate functions(like sum(), mean(), count(), etc().) on each grroup. Consider this DataFrame

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10", "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

In [4]:
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

In [5]:
df.groupby("Department")["Salary"].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

In [6]:
df.groupby("Department")["Age"].mean()

Department
HR           24.0
IT           26.0
Marketing    27.0
Sales        24.0
Name: Age, dtype: float64

In [7]:
type(df.groupby("Department")["Salary"].mean())

pandas.core.series.Series

In [8]:
type(df.groupby("Department")["Age"].mean())

pandas.core.series.Series

# Common Aggregation Functions

In [9]:
df.groupby("Department")["Salary"].sum()

Department
HR           175
IT           163
Marketing    180
Sales        155
Name: Salary, dtype: int64

In [10]:
df.groupby("Team")["Salary"].sum()

Team
A    175
B    163
C    180
D    155
Name: Salary, dtype: int64

In [11]:
df.groupby("Team")["Salary"].count()

Team
A    2
B    2
C    2
D    2
Name: Salary, dtype: int64

In [12]:
df.groupby("Team")["Salary"].min()

Team
A    85
B    78
C    88
D    75
Name: Salary, dtype: int64

In [13]:
df.groupby("Team")["Salary"].max()

Team
A    90
B    85
C    92
D    80
Name: Salary, dtype: int64

In [14]:
df.groupby("Department")["Salary"].max()

Department
HR           90
IT           85
Marketing    92
Sales        80
Name: Salary, dtype: int64

# We can also groupby using multiple columns

In [15]:
df.groupby(["Team","Gender"])["Salary"].max()

Team  Gender
A     F         90
      M         85
B     F         85
      M         78
C     F         88
      M         92
D     F         80
      M         75
Name: Salary, dtype: int64

In [16]:
df.groupby(["Department","Gender"])["Salary"].max()

Department  Gender
HR          F         90
            M         85
IT          F         85
            M         78
Marketing   F         88
            M         92
Sales       F         80
            M         75
Name: Salary, dtype: int64

Custom aggregation with .agg()

In [17]:
df.groupby("Department")["Salary"].agg(["max","min","mean"])

            max  min  mean
Department
HR           90   85  87.5
IT           85   78  81.5
Marketing    92   88  90.0
Sales        80   75  77.5

In [18]:
df.groupby("Team")["Salary"].agg(["max","min","mean"])

      max  min  mean
Team
A      90   85  87.5
B      85   78  81.5
C      92   88  90.0
D      80   75  77.5

In [19]:
type(df.groupby("Team")["Salary"].agg(["max","min","mean"]))

pandas.core.frame.DataFrame

# Transform

In [20]:
df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")

In [21]:
df

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0
6      Sales    D      M      75   21 2021-07-15      77.5
7      Sales    D      F      80   27 2021-08-01      77.5

# Filter()

In [23]:
df.groupby("Team").filter(lambda x: x["Salary"].mean() > 85)

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0